In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../datasets/StudentsPerformance.csv')

In [3]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [6]:
df.mean()

/var/folders/tm/ffwlhhvs4hjbp97q0xdt53r80000gn/T/ipykernel_1948/3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

In [7]:
df.median()

/var/folders/tm/ffwlhhvs4hjbp97q0xdt53r80000gn/T/ipykernel_1948/530051474.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

math score       66.0
reading score    70.0
writing score    69.0
dtype: float64

In [8]:
df.mode()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some college,standard,none,65,72,74

In [9]:
df[['math score','writing score']].groupby(['writing score']).describe().unstack()

                   writing score
math score  count  10                 1.0
                   15                 1.0
                   19                 1.0
                   22                 1.0
                   23                 1.0
                                    ...
            max    96                97.0
                   97               100.0
                   98                85.0
                   99               100.0
                   100              100.0
Length: 616, dtype: float64

In [14]:
correlation = df[['math score','reading score']].corr()

In [15]:
import seaborn as sns

In [ ]:
sns.heatmap(data=co)